tap "anchore/grype"
tap "anchore/syft"
tap "ankitpokhrel/jira-cli"
tap "azure/kubelogin"
tap "derailed/k9s"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "streamdal/public"
tap "textualize/homebrew"

# Add custom keybindings
brew "koekeishiya/formulae/skhd"

# Bash Shell
brew "bash"

# Terminal workspace
brew "zellij"

# Shell Prompt
brew "starship"

# Shell history
brew "atuin"

# Smarter cd command
brew "zoxide"

# Fuzzy Finder
brew "fzf"

# Shell Tips
brew "navi"

# Better diff
brew "git-delta"

# Better Make / Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task/tap/go-task"


# Cloud CLIs
brew "akamai"
brew "azure-cli"
brew "ankitpokhrel/jira-cli/jira-cli"

# Kubernetes
brew "kubernetes-cli"
brew "helm"
brew "kubectx"
brew "azure/kubelogin/kubelogin"
brew "derailed/k9s/k9s"
brew "stern"

# Containers
brew "kind"
brew "podman"
# Tool for exploring each layer in a docker image
brew "dive"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Vulnerability scanner for container images and filesystems
brew "grype"

# Terraform / Hashicorp
brew "tfenv"
brew "hashicorp/tap/vault"

# Monitoring
# Run LogQL queries against a Loki server
brew "logcli"

# Tools
brew "eza"
brew "fd"
brew "bat"
brew "ripgrep"
brew "gum"
brew "bitwarden-cli"

# Linux tools
brew "gnu-sed"
brew "watch"
brew "wget"
brew "gnupg"

# JSON / YAML / CSV / Markdown
brew "fx"
brew "jsonnet"
brew "jq"
brew "yq"
brew "csvlens"
brew "frogmouth"

# Dev Tools
brew "neovim"
brew "tig"
brew "gitui"
# Autoformat shell script source code
brew "shfmt"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
brew "nvm"
brew "node"
brew "go"
brew "uv"
# Tool for kafka, RabbitMQ, ...
brew "plumber"

cask "amethyst"
cask "bitwarden"
cask "keycastr"
cask "raycast"
cask "rectangle"
cask "spotify"
